{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5d8741ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.wikidata.org/entity/Q121484467 - Cancionero Popular Vasco\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "query = \"\"\"\n",
    "SELECT ?item ?itemLabel WHERE {\n",
    "  ?item rdfs:label \"Albert Einstein\"@en.\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "url = \"https://query.wikidata.org/sparql\"\n",
    "\n",
    "headers = {\n",
    "    \"Accept\": \"application/json\",\n",
    "    \"User-Agent\": \"MyWikidataApp/1.0 (maria@example.com)\"\n",
    "}\n",
    "\n",
    "response = requests.get(url, params={\"query\": query}, headers=headers)\n",
    "\n",
    "data = response.json()\n",
    "\n",
    "for item in data[\"results\"][\"bindings\"]:\n",
    "    print(item[\"item\"][\"value\"], \"-\", item[\"itemLabel\"][\"value\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "e05b9cd1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "image : http://commons.wikimedia.org/wiki/Special:FilePath/Cancionero%20Popular%20Vasco-ren%203.%20liburukiaren%20azala.jpg\n",
      "instance of : book\n",
      "author : Resurrección María de Azkue\n",
      "publication date : 1918-01-01T00:00:00Z\n",
      "described at URL : https://www.eresbil.eus/web/uploads/archivosGeneradorWeb/Arana%20Martija/AZKUE%20-%20CANCIONERO%20POPULAR%20VASCO.pdf\n",
      "length : 1697\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "query = \"\"\"\n",
    "SELECT ?property ?propertyLabel ?value ?valueLabel WHERE {\n",
    "  wd:Q121484467 ?prop ?value .\n",
    "  ?property wikibase:directClaim ?prop .\n",
    "  \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "url = \"https://query.wikidata.org/sparql\"\n",
    "headers = {\n",
    "    \"Accept\": \"application/json\",\n",
    "    \"User-Agent\": \"MyWikidataApp/1.0 (maria@example.com)\"\n",
    "}\n",
    "\n",
    "response = requests.get(url, params={\"query\": query}, headers=headers)\n",
    "data = response.json()\n",
    "\n",
    "for row in data[\"results\"][\"bindings\"]:\n",
    "    print(row[\"propertyLabel\"][\"value\"], \":\", row.get(\"valueLabel\", {}).get(\"value\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "eb8cff56",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://eu.wikipedia.org/ → https://eu.wikipedia.org/wiki/Cancionero_Popular_Vasco\n",
      "https://fr.wikipedia.org/ → https://fr.wikipedia.org/wiki/Cancionero_popular_vasco\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "query = \"\"\"\n",
    "SELECT ?wiki ?article WHERE {\n",
    "  VALUES ?item { wd:Q121484467 }\n",
    "  ?article schema:about ?item ;\n",
    "           schema:isPartOf ?wiki .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "url = \"https://query.wikidata.org/sparql\"\n",
    "headers = {\n",
    "    \"Accept\": \"application/json\",\n",
    "    \"User-Agent\": \"MyWikidataApp/1.0 (maria@example.com)\"\n",
    "}\n",
    "\n",
    "response = requests.get(url, params={\"query\": query}, headers=headers)\n",
    "data = response.json()\n",
    "\n",
    "for row in data[\"results\"][\"bindings\"]:\n",
    "    print(row[\"wiki\"][\"value\"], \"→\", row[\"article\"][\"value\"])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
